# Titanic Data Wrangling

The dataset contains data for 887 of the real Titanic passengers. Each row represents one person. The columns describe different attributes about the person including whether they survived (S), their age (A), their passenger-class (C), their sex (G) and the fare they paid (X). The table below shows the Data Dictionary.

## Import Package

In [1]:
import pandas as pd
import numpy as np

## Load the dataset

In [2]:
data = pd.read_csv("titanic.csv")

In [3]:
data.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

## What is the dimension (col, row) of the data frame

In [4]:
data.shape

(887, 8)

## How to know data type of each variable?

In [5]:
data.dtypes

Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

## How many passengers survived (Survived=1) and not-survived (Survived=0)?

In [6]:
passsurv = data.groupby("Survived")
passenger = passsurv["Survived"].count()
passenger

Survived
0    545
1    342
Name: Survived, dtype: int64

## How to drop column ‘Name’ from the data frame?

In [7]:
data = data.drop(['Name'], axis = 1)
data

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,male,22.0,1,0,7.2500
1,1,1,female,38.0,1,0,71.2833
2,1,3,female,26.0,0,0,7.9250
3,1,1,female,35.0,1,0,53.1000
4,0,3,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,male,27.0,0,0,13.0000
883,1,1,female,19.0,0,0,30.0000
884,0,3,female,7.0,1,2,23.4500
885,1,1,male,26.0,0,0,30.0000
886,0,3,male,32.0,0,0,7.7500

## Add one new column called ‘family’ to represent number of family-member aboard (hint: family = sibsp + parch)

In [8]:
data['family'] = data['Siblings/Spouses Aboard'] + data['Parents/Children Aboard']
data['family']

0      1
1      1
2      0
3      1
4      0
      ..
882    0
883    0
884    3
885    0
886    0
Name: family, Length: 887, dtype: int64

## As shown, columns ‘Age’ contains missing values. Please add new column named ‘Age_miss’ to indicate whether Age is missing or not (Age_miss = ‘YES’ for missing value and ‘NO’ for non-missing value).

### check the missing value

In [9]:
count_missing = data.isnull().sum().sort_values(ascending = False)
print(count_missing)
percentage_missing = round(data.isnull().sum()/len(data)*100,2).sort_values(ascending=False)
print(percentage_missing)

family                     0
Fare                       0
Parents/Children Aboard    0
Siblings/Spouses Aboard    0
Age                        0
Sex                        0
Pclass                     0
Survived                   0
dtype: int64
family                     0.0
Fare                       0.0
Parents/Children Aboard    0.0
Siblings/Spouses Aboard    0.0
Age                        0.0
Sex                        0.0
Pclass                     0.0
Survived                   0.0
dtype: float64

### add column to indicate whether Age is missing or not

In [10]:
data['Age_miss'] = np.where(data['Age'].notnull, 'No', 'Yes')
data

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family,Age_miss
0,0,3,male,22.0,1,0,7.2500,1,No
1,1,1,female,38.0,1,0,71.2833,1,No
2,1,3,female,26.0,0,0,7.9250,0,No
3,1,1,female,35.0,1,0,53.1000,1,No
4,0,3,male,35.0,0,0,8.0500,0,No
...,...,...,...,...,...,...,...,...,...
882,0,2,male,27.0,0,0,13.0000,0,No
883,1,1,female,19.0,0,0,30.0000,0,No
884,0,3,female,7.0,1,2,23.4500,3,No
885,1,1,male,26.0,0,0,30.0000,0,No
886,0,3,male,32.0,0,0,7.7500,0,No

## Please ﬁll Age missing value with means of existing Age values

In [11]:
data['Age'] = data['Age'].fillna(data['Age'].mean())
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
882    27.0
883    19.0
884     7.0
885    26.0
886    32.0
Name: Age, Length: 887, dtype: float64

## What is the maximum passenger Age who survived from the tragedy?

In [12]:
maxpass = data[data['Survived']==1]
maxage = maxpass['Age'].max()
print ('Maximum passenger Age who survived from the tragedy is '+ str(maxage))

Maximum passenger Age who survived from the tragedy is 80.0

## How many passengers survived from each ‘PClass’?

In [13]:
maxpassenger = data[data['Survived']==1]
passurvi = maxpassenger.groupby("Pclass")
pclasssurvived = passurvi['Pclass'].count()
pclasssurvived

Pclass
1    136
2     87
3    119
Name: Pclass, dtype: int64

## How to randomly split the data frame into 2 parts (titanic1 and titanic2) with proportion of 0.7 for tttanic1 and 0.3 for titanic2 ?

### import package for split train and test

In [14]:
from sklearn.model_selection import train_test_split

### split data

In [15]:
feature_names = list(data.columns)

In [16]:
titanic1, titanic2 = train_test_split(data[feature_names], test_size=0.3, random_state=1)

### dimension of data train

In [17]:
titanic1.shape

(620, 9)

In [18]:
titanic1

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family,Age_miss
76,0,3,male,28.0,0,0,8.0500,0,No
872,0,3,male,20.0,0,0,9.8458,0,No
740,1,3,male,31.0,0,0,7.9250,0,No
132,1,2,female,29.0,1,0,26.0000,1,No
473,0,2,male,34.0,1,0,21.0000,1,No
...,...,...,...,...,...,...,...,...,...
715,0,3,male,33.0,0,0,7.7750,0,No
767,0,3,male,48.0,0,0,7.8542,0,No
72,0,3,male,26.0,1,0,14.4542,1,No
235,0,2,male,44.0,1,0,26.0000,1,No
37,0,3,male,21.0,0,0,8.0500,0,No

### dimension of data test

In [19]:
titanic2.shape

(267, 9)

In [20]:
titanic2

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family,Age_miss
522,0,3,male,40.5,0,0,7.7500,0,No
314,1,2,female,24.0,1,0,26.0000,1,No
768,0,2,female,57.0,0,0,10.5000,0,No
320,1,2,female,30.0,0,0,12.3500,0,No
809,0,3,female,6.0,4,2,31.2750,6,No
...,...,...,...,...,...,...,...,...,...
239,0,3,female,19.0,1,0,14.4542,1,No
688,1,3,female,4.0,0,1,13.4167,1,No
92,0,3,male,26.0,1,2,20.5750,3,No
114,0,3,male,21.0,0,0,7.9250,0,No
870,1,2,female,28.0,1,0,24.0000,1,No